test/goldens/graph-to-dot/graph_test_07.dot
digraph unix {
  graph [ dpi = 72 ]; 
  graph [nodesep = 0.25; ranksep=0.25];
  fontname="Arial"
  node [fontname="Arial"]
  edge [fontname="Arial"]
  subgraph cluster_level3_74 {
    label = "level3"; // scope
    s111_138 [
      label = "s111"; // node
    ];
    c111_152 [
      label = "c111"; // node
    ];
    subgraph cluster_level2_75 {
      label = "level2"; // scope
      style = filled;
      fillcolor = "#AAFFFF88";
      s11_139 [
        label = "s11"; // node
      ];
      s10_140 [
        label = "s10"; // node
      ];
      s01_141 [
        label = "s01"; // node
      ];
      s00_142 [
        label = "s00"; // node
      ];
      c00_148 [
        label = "c00"; // node
      ];
      c01_149 [
        label = "c01"; // node
      ];
      c10_150 [
        label = "c10"; // node
      ];
      c11_151 [
        label = "c11"; // node
      ];
      subgraph cluster_level1_76 {
        label = "level1"; // scope
        s1_143 [
          label = "s1"; // node
        ];
        s0_144 [
          label = "s0"; // node
        ];
        c0_146 [
          label = "c0"; // node
        ];
        c1_147 [
          label = "c1"; // node
        ];
        subgraph cluster_level0_77 {
          label = "level0"; // scope
          style = filled;
          fillcolor = "#AAFFFF88";
          x_145 [
            label = "x"; // node
          ];
          
        }
        
      }
      
    }
    
  }
  "s111_138" -> "s11_139";
  "s11_139" -> "s1_143";
  "s10_140" -> "s1_143";
  "s01_141" -> "s0_144";
  "s00_142" -> "s0_144";
  "c11_151" -> "c111_152";
  "s1_143" -> "x_145";
  "s0_144" -> "x_145";
  "c0_146" -> "c00_148";
  "c0_146" -> "c01_149";
  "c1_147" -> "c10_150";
  "c1_147" -> "c11_151";
  "x_145" -> "c0_146";
  "x_145" -> "c1_147";
}
